ArduCAM/Energia/tools/common/DSLite/common/targetdb/Modules/MSP432/fpu.xml
<module id="FPU" HW_revision=""><register id="FPCCR_" width="32" offset="0xF34" internal="0" description="Floating Point Context Control Register"><bitfield id="LSPACT" description="Indicates whether Lazy preservation of the FP state is active." begin="0" end="0" width="1" rwaccess="R/W"/><bitfield id="USER" description="Indicates the privilege level of the software executing was Use" begin="1" end="1" width="1" rwaccess="R/W"/><bitfield id="THREAD" description="Indicates the processor mode was Thread when it allocated the F" begin="3" end="3" width="1" rwaccess="R/W"/><bitfield id="HFRDY" description="Indicates whether the software executing when the processor all" begin="4" end="4" width="1" rwaccess="R/W"/><bitfield id="MMRDY" description="Indicates whether the software executing when the processor all" begin="5" end="5" width="1" rwaccess="R/W"/><bitfield id="BFRDY" description="Indicates whether the software executing when the processor all" begin="6" end="6" width="1" rwaccess="R/W"/><bitfield id="MONRDY" description="Indicates whether the the software executing when the processor" begin="8" end="8" width="1" rwaccess="R/W"/><bitfield id="LSPEN" description="Lazy State Preservation ENable" begin="30" end="30" width="1" rwaccess="R/W"/><bitfield id="ASPEN" description="Automatic State Preservation ENable" begin="31" end="31" width="1" rwaccess="R/W"/></register><register id="FPCAR_" width="32" offset="0xF38" internal="0" description="Floating-Point Context Address Register"><bitfield id="ADDRESS" description="Holds the (double-word-aligned) location of the unpopulated flo" begin="30" end="2" width="29" rwaccess="R/W"/></register><register id="FPDSCR_" width="32" offset="0xF3C" internal="0" description="Floating Point Default Status Control Register"><bitfield id="RMODE" description="Default value for Rounding Mode control field" begin="23" end="22" width="2" rwaccess="R/W"/><bitfield id="FZ" description="Default value for Flush-to-Zero mode bit" begin="24" end="24" width="1" rwaccess="R/W"/><bitfield id="DN" description="Default value for Default NaN mode bit" begin="25" end="25" width="1" rwaccess="R/W"/><bitfield id="AHP" description="Default value for Alternative Half Precision bit" begin="26" end="26" width="1" rwaccess="R/W"/></register><register id="MVFR0_" width="32" offset="0xF40" internal="0" description="Media and FP Feature Register 0 (MVFR0)"><bitfield id="A_SIMD_REGISTERS" description="Indicates the size of the FP register bank" begin="3" end="0" width="4" rwaccess="R/W"/><bitfield id="SINGLE_PRECISION" description="Indicates the hardware support for FP single-precision operatio" begin="7" end="4" width="4" rwaccess="R/W"/><bitfield id="DOUBLE_PRECISION" description="Indicates the hardware support for FP double-precision operatio" begin="11" end="8" width="4" rwaccess="R/W"/><bitfield id="FP_ECEPTION_TRAPPING" description="Indicates whether the FP hardware implementation supports excep" begin="15" end="12" width="4" rwaccess="R/W"/><bitfield id="DIVIDE" description="Indicates the hardware support for FP divide operations" begin="19" end="16" width="4" rwaccess="R/W"/><bitfield id="SQUARE_ROOT" description="Indicates the hardware support for FP square root operations" begin="23" end="20" width="4" rwaccess="R/W"/><bitfield id="SHORT_VECTORS" description="Indicates the hardware support for FP short vectors" begin="27" end="24" width="4" rwaccess="R/W"/><bitfield id="FP_ROUNDING_MODES" description="Indicates the rounding modes supported by the FP floating-point" begin="31" end="28" width="4" rwaccess="R/W"/></register><register id="MVFR1_" width="32" offset="0xF44" internal="0" description="Media and FP Feature Register 1 (MVFR1)"><bitfield id="FTZ_MODE" description="Indicates whether the FP hardware implementation supports only " begin="3" end="0" width="4" rwaccess="R/W"/><bitfield id="D_NAN_MODE" description="Indicates whether the FP hardware implementation supports only " begin="7" end="4" width="4" rwaccess="R/W"/><bitfield id="FP_HPFP" description="Indicates whether the FP supports half-precision floating-point" begin="27" end="24" width="4" rwaccess="R/W"/><bitfield id="FP_FUSED_MAC" description="Indicates whether the FP supports fused multiply accumulate ope" begin="31" end="28" width="4" rwaccess="R/W"/></register></module>